/**
 * @author Administrator
 */

	var INIT_MONEY=2000;//初始化的金钱数
	var INIT_SAVING=3000;//初始存款数
	var SAVING_PERCENT=1.05;//存款利息;
	var ARREAR_PERCENT=1.15;//欠款高利息;
	var SHOP_LIST_SIZE=5;//商店基本物品数目;
	var SHOP_LIST_ADD=1;//商品增加的数目;
	var MAX_GOODS_SIZE=100//物品的最大储存量
	var MAX_MIN_PRICE_PERCENT=0.2;//出现特殊价格的几率;
	var MAX_PRICE_COUNT=2//每次最多出现的特价商品数量
	var MAX_PRICE=4//最高价格的倍数
	var MIN_PRICE=2//最低价格倍数
	var MAX_PERCENT=0.55;//低价倍率
	var MIN_PERCENT=0.25;
	var MAX_DATE=40//游戏结束日期
	var EVENT_PERCENT=0.3;//事件发生的几率
	var HEALTH_MONEY=3888;
	var MAX_ARREAR=200000;//最高负债;
			/**
			 *  [商品名,商品底价,随机价格的倍率,高价提示信息,低价提示信息]
			 */
			var shopGoods= [
			["盗版光盘",10,4,"看国外正版碟还不如看国产盗版碟","这里卖盗版CD的人太多了,卖不出去啊!"],
			["伪劣化妆品",80,3,"提倡节约风尚,不用奢侈品", ],
			["进口香烟",150,2.5,"玩的就是洋货,抽的就是进口烟","最近大家喜欢自己种烟抽"],
			["进口玩具",300,3,"专家说玩具可以开发孩子智力", ],
			["水货手机",700,2.5,"开学了,很多学生买新手机了"],
			["假白酒",2000,2.5,"一斤酒只兑一斤水,可以冒充高档酒卖","假酒又喝死人了,假酒每人敢喝"],
			["上海小宝贝",5000,2.5,"吃伟哥还不如看<上海小宝贝>",],
			["杂牌小汽车",10000,2.2,,"杂牌汽车刹车失灵撞墙了"],
			["豪华跑车",30000,2,"生活富裕了,人人开跑车"]
			];//商店物品;
			/**
			 * 0 : my.money金钱 数量
			 * 1 : my.money金钱百分比
			 * 2 : goods得到物品[消息,事件类型 2,最小数量,最大数量]
			 * 3 : my.health
			 * 4 : my.saving数量
			 * 5 : my.saving百分比
			 */
			var Events=
			[
				["在路上摔一跤,捡了 $ 元钱",0,5000],
				["在路上走,掉进下水道了, 健康减少 $ ",3,3],
				["小学同学送我 $ 个 & ,爽死了",2,2,5],//[消息,事件类型 2,最小数量,最大数量]
				["早上出门被乞丐要走了 $ 元",1,-0.2],
				["欺负小狗,被咬了一口 ,健康减少 $ ",3,4],
				["跟城管打群架,少了 $ 的健康",3,5],
				["在一个小胡同里看到 $ 个 没人要的 & ,翻新一下 ,新的一样",2,1,3],
				["走着走着,被一个小孩抢走 $ 元",1,-0.3],
				["交清了这个月的保护费,共花了 $ 元",1,-0.25],
				["黑客入侵银行,莫名其妙增加 $ 元存款",5,0.3],
				["银行系统故障, $ 元存款不翼而飞",5,0.2],
				["在路上被打一顿,健康减少 $ ",3,5]
			];